{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_ids": 0,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "First Party Collection/Use",
    "1": "Third Party Sharing/Collection",
    "2": "User Choice/Control",
    "3": "User Access, Edit and Deletion",
    "4": "Data Retention",
    "5": "Data Security",
    "6": "Policy Change",
    "7": "International and Specific Audiences",
    "8": "Do Not Track",
    "9": "Other"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Data Retention": 4,
    "Data Security": 5,
    "Do Not Track": 8,
    "First Party Collection/Use": 0,
    "International and Specific Audiences": 7,
    "Other": 9,
    "Policy Change": 6,
    "Third Party Sharing/Collection": 1,
    "User Access, Edit and Deletion": 3,
    "User Choice/Control": 2
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
